1. 2023-11-27 20:34:13.212967 - распечатать эту дату, но на неделю позже. Должно получиться 2023-12-04 20:34:13.212967
2. 2023-07-15 18:25:10.121473 - распечатать какой это будет день недели
3. 2023-06-12 15:23:45.312167 - распечатать сколько дней назад была эта дата2023-12-04 00:00:00
Saturday
591 days ago
423 days ago
558 days ago
591 days ago
1. 2023-12-04 20:34:13.212967
2. Saturday
3. 590 дней назад
1. 2023-12-04 20:34:13.212967
2. Saturday
3. 590 дней назад
1. 2023-12-04 20:34:13.212967
2. Saturday
3. 590 дней назад
2023-12-04 20:34:13.2129672. Saturday
3. 590 дней назад
2023-12-04 20:34:13.212967Saturday5902023-12-04 20:34:13.212967Saturday5902023-12-04 20:34:13.212967Saturday590